{
    "Home":"الرئيسية",
   "Welcome to our academy, where we combine high-quality education with personal development, in an environment that caters to the needs of students from Europe and ensures they do not miss out on core curriculums.":"مرحباً بكم في أكادميتنا حيث ندمج بين التعليم الراقي والتطوير الشخصي ، في بيئة تراعي احتياجات الطلاب القادمين من أوروبا وتحرص على عدم تفويتهم للمناهج  الأساسية .",
   "Providing an integrated education that combines educational values ​​and strong academic instruction in Arabic and English, while respecting diverse cultural backgrounds.":"تقديم تعليم متكامل يجمع بين القيم التربوية والتعليم الأكاديمي القوي باللغة العربية والإنجليزية ، مع احترام الخلفيات الثقافية المتنوعة",
   "Our vision":"رؤيتنا",
   "Our mission":"رسالتنا",
   "Accompanying the student on a cognitive journey that focuses on developing critical thinking and self-reliance, while maintaining a high level of basic subjects.":"مرافقة الطالب في رحلة معرفية تركز على تنمية التفكير النقدي ، والإعتماد على الذات ، مع المحافظة على مستوى عالي من المواد الأساس",
"Iqdam Educational Academy is an innovative educational academy that aims to enable individuals to achieve their educational and professional goals in a modern and effective manner.":"أكاديمية إقدام التعليمية هي أكاديمية تعليمية مبتكرة تهدف إلى تمكين الأفراد من تحقيق اهدافهم التعليمية والمهنية بأسلوب عصري وفعال",
"Features":"المميزات",
"Programs":"البرامج",
"Registration":"التسجيل",
"Parent services":"خدمات أولياء الأمور",
      "Periodic reports and academic follow-up": "تقارير دورية ومتابعة أكاديمية",
      "Submit detailed reports on academic performance on a regular basis.":"إرسال تقارير تفصيلية عن الأداء الأكاديمي بشكل دوري.",
      "Personal interviews with teachers":"مقابلات شخصية مع المعلمين",
      "Providing the opportunity to meet directly with teachers to follow up on children.":"إتاحة الفرصة للقاء مباشر مع المعلمين لمتابعة الأبناء.",
      "Translation of curricula and lessons":"ترجمة المناهج والدروس",
      "Translate educational content when needed to ensure full understanding.":"ترجمة المحتوى التعليمي عند الحاجة لضمان الفهم الكامل.",
      "Psychological and social support for children":"دعم نفسي واجتماعي للأبناء",
      "Providing psychosocial support sessions to promote mental health.":"توفير جلسات دعم نفسي واجتماعي لتعزيز الصحة الذهنية."


}