{
    "Home": "الرئيسية",
    "Welcome to our academy, where we combine high-quality education with personal development, in an environment that caters to the needs of students from Europe and ensures they do not miss out on core curriculums.": "مرحباً بكم في أكادميتنا حيث ندمج بين التعليم الراقي والتطوير الشخصي ، في بيئة تراعي احتياجات الطلاب القادمين من أوروبا وتحرص على عدم تفويتهم للمناهج  الأساسية .",
    "Providing an integrated education that combines educational values ​​and strong academic instruction in Arabic and English, while respecting diverse cultural backgrounds.": "تقديم تعليم متكامل يجمع بين القيم التربوية والتعليم الأكاديمي القوي باللغة العربية والإنجليزية ، مع احترام الخلفيات الثقافية المتنوعة",
    "Our vision": "رؤيتنا",
    "Our mission": "رسالتنا",
    "Accompanying the student on a cognitive journey that focuses on developing critical thinking and self-reliance, while maintaining a high level of basic subjects.": "مرافقة الطالب في رحلة معرفية تركز على تنمية التفكير النقدي ، والإعتماد على الذات ، مع المحافظة على مستوى عالي من المواد الأساس",
    "Iqdam Educational Academy is an innovative educational academy that aims to enable individuals to achieve their educational and professional goals in a modern and effective manner.": "أكاديمية إقدام التعليمية هي أكاديمية تعليمية مبتكرة تهدف إلى تمكين الأفراد من تحقيق اهدافهم التعليمية والمهنية بأسلوب عصري وفعال",
    "Features": "المميزات",
    "Programs": "البرامج",
    "Registration": "التسجيل",
    "Parent services": "خدمات أولياء الأمور",
    "Periodic reports and academic follow-up": "تقارير دورية ومتابعة أكاديمية",
    "Submit detailed reports on academic performance on a regular basis.": "إرسال تقارير تفصيلية عن الأداء الأكاديمي بشكل دوري.",
    "Personal interviews with teachers": "مقابلات شخصية مع المعلمين",
    "Providing the opportunity to meet directly with teachers to follow up on children.": "إتاحة الفرصة للقاء مباشر مع المعلمين لمتابعة الأبناء.",
    "Translation of curricula and lessons": "ترجمة المناهج والدروس",
    "Translate educational content when needed to ensure full understanding.": "ترجمة المحتوى التعليمي عند الحاجة لضمان الفهم الكامل.",
    "Psychological and social support for children": "دعم نفسي واجتماعي للأبناء",
    "Providing psychosocial support sessions to promote mental health.": "توفير جلسات دعم نفسي واجتماعي لتعزيز الصحة الذهنية.",
    "Welcome to Iqdam academy for education!": "أهلاً بك في أكاديمية إقدام التعليمية!",
    "Contact Us via Email": "تواصل معنا عبر البريد الإلكتروني",
    "Enter the subject": "اكتب العنوان",
    "Write your message here": "اكتب رسالتك هنا",
    "Send Email": "أرسل إيميل",
    "Contact Information":"معلومات التواصل",
    "Quick Links":"روابط سريعة",
    "Mail Us":"الإيميل",
    "Phone":"الموبايل",
    "All rights reserved to Iqdam.":"جميع الحقوق محفوظة لأكديمية إقدام",
    "Privacy Policy":"سياسة الخصوصية",
    "Entertainment programs":"البرامج الترفيهية",
    "Educational programs":"البرامج التعليمية",
    "International program for european students":"البرنامج الدولي للطلاب الأوروبيين",
    "Aligning Omani curricula with European standards, special support in languages ​​(Arabic and English), and support units in mathematics and science (in English).":"موائمة المناهج العُمانية مع المعايير الأوروبية ودعم خاص في اللغات ( العربية والإنجليزية ) ووحدات دعم في الرياضيات والعلوم ( باللغة الإنجليزية )",
    "Learn Arabic for non-native speakers":"تعلم اللغة العربية لغير الناطقين بها",
    "Through modern and interactive curricula, realistic communication activities, and life situations, at various levels (beginner - intermediate - advanced). We also offer programs for parents (upon request).":"عن طريق مناهج حديثة وتفاعلية وأنشطة تواصل واقعية ومواقف حياتية وبمستويات متنوعة ( مبتديء - متوسط - متقدم ) كما نقدم أيضاً برامج لأولياء الأمور ( عند الطلب )",
    "Support for basic educational materials":"دعم المواد التعليمية الأساسية",
    "Mathematics (flexible curricula combining Arabic and English), Physics and Chemistry (equipped laboratories and experimental activities), Geography (interactive project-based lessons), English (developing reading, writing, speaking and listening)":"الرياضيات ( مناهج مرنة تجمع بين العربية والإنجليزية ) ، الفيزياء والكيمياء ( محتبرات مجهزة وأنشطة تجريبية ) ، الجغرافيا ( دروس تفاعلية تعتمد على المشاريع ) ، اللغة الإنجليزية ( تطوير القراءة والكتابة والتحدث والإستماع )",
    "Our education is project-based, with monthly projects within each subject, and all subjects integrated into one project.We encourage teamwork, innovation, and personal and social development.There are social skills development courses, programs for values ​​and positive behavior, as well as workshops for time management, problem solving, and leadership.":"      التعليم لدينا يكون قائم على المشاريع ويوجد مشاريع شهرية ضمن كل مادة كما يتم دمج المواد كلها في مشروع واحد ، ونشجع على العمل الجماعي والإبتكار والتطوير الشخصي والإجتماعي ويوجد جلسات تنمية للمهارات الإجتماعية وبرامج لقلقيم والسلوك الإيجابي وأيضا ورش عمل لإدارة الوقت وحل المشكلات والقيادة",
"Educational and recreational trips":"الرحلات التربوية والترفيهية",
"The Academy organizes educational and recreational trips to cultural and natural sites within the Sultanate of Oman to enhance real-life learning":"تنظم الأكاديمية رحلات تعليمية وترفيهية إلى نعالم ثقافية وطبيعية داخل سلطنة عُمان لتعزيز التعلم من الواقع",
"Artistic and theatrical activities":"أنشطة فنية ومسرحية",
"Workshops for drawing, theater, and Arabic calligraphy develop creativity and reveal students talents in a fun environment":"ورش للرسم والمسرح والخط العربي تُنمي الإبداع وتكشف عن المواهب الطلابية في بيئة ممتعة",
"Sporting events and competitions":"فعاليات رياضية ومسابقات",
"Organizing internal and external tournaments in various sports (football, tennis, tug of war) to enhance sportsmanship and teamwork":"تنظيم بطولات داخلية وخارجية في مختلف الرياضات ( كرة قدم ، تنس ، شد الحبل ) تغزز الروح الرياضية والعمل الجماعي",
"Skill and hobby clubs":"أندية مهارية وهوايات",
"Reading, programming, chess, and robotics clubs develop mental skills and break the study routine":"أندية القراءة ، البرمجة ، الشطرنج ، والروبوتات تُنمي المهارات الذهنية وتكسر روتين الدراسة",
"Open days and student exhibitions":"أيام مفتوحة ومعارض طلابية",
"Organizing open recreational days where students projects are displayed, with interactive activities for parents and students together":"تنظيم أيام ترفيهية مفتوحة تُعرض فيها مشاريع الطلاب ، مع أنشطة تفاعلية للأهل والطلاب معاً",
"Contact us":"تواصل معنا",
"Academy Location, Muscat, Oman":"موقع الأكاديمية ، مسقط ، عُمان",
"Whatsapp":"واتساب",
"Facebook":"فيس بوك",
"Instagram":"إنستجرام",
"Tik tok":"تيك توك",
"Twitter":"تويتر",
"Youtube":"يوتيوب",
"Snapchat":"سناب شات",
"Payment":"الدفع",
"Go to payment":"اذهب للدفع",
"Teachers":"المدرسين",
"Teachers Advantages":"مميزات المدرسين",
"How We Select Teachers?":"كيف نختار المدرسين؟",
"Educational and teaching experience":"خبرة تربوية وتعليمية",
"Teachers have extensive field experience in dealing with different educational levels and student needs":"يتمتع المعلمون بخبرة ميدانية واسعة في التعامل مع مختلف المستويات الدراسية واحتياجات الطلبة",
"High scientific efficiency":"كفاءة علمية عالية",
"The teaching team holds advanced academic qualifications and is committed to continuous self-development in their areas of expertise":"يحمل فريق التعليم مؤهلات أكاديمية متقدمة ، ويحرصون على التطوير الذاتي المستمر في مجالات تخصصهم",
"Innovative teaching methods":"أساليب تدريس مبتكرة",
"Teachers use modern teaching strategies based on interaction, motivation, and active learning":"يستخدم المعلمون استراتيجيات تدريس حديثة قائمة على التفاعل ، والتحفيز ، والتعليم النشط",
"Individual care for students":"رعاية فردية للطلبة",
"The teacher cares for each student individually, and follows up on his academic and behavioral level in a supportive and motivating manner":"يهتم المعلم بكل طالب على حدة ، ويتابع مستواه الاكاديمي والسلوكي بطريقة داعمة ومحفزة",
"Moral and educational values":"قيم أخلاقية وتربوية",
"Teachers have a sense of responsibility and discipline and believe in their educational mission to build a distinguished, aware generation":"بتمتع المعلمون بروح المسؤلية والإنضباط ويؤمنون برسالتهم التربوية في بناء جيل واع متميز",
"Effective communication with parents":"تواصل فعال مع أولياء الأمور",
"Teachers maintain a constant and professional communication channel with parents to ensure the integrity of the educational process":"يحافظ المعلمون على قناة تواصل دائمة واحترافية مع أولياء الأمور لضمان تكامل العملية التعليمية",
"Verification of academic qualifications":"التدقيق في المؤهلات العلمية",
"Academic credentials and specializations are carefully verified to ensure specialization and competence":"يتم التحقق من الشهادات الأكاديمية والتخصصات بدقة لضمان التخصص والكفاءة",
"Choosing educational competence":"اختيار الكفاءة التربوية",
"The candidate undergoes assessment tests in teaching methods, classroom management, and dealing with different student styles":"يخضع المرشح لاختبارات تقييم في طرق التدريس ، إدارة الصف ، والتعامل مع أنماط الطلاب المختلفة",
"Accurate personal interviews":"مقابلات شخصية دقيقة",
"We conduct interviews that measure personality, communication style, ethical values, and the ability to positively influence students":"نُجري مقابلات تقيس الشخصية ، أسلوب التواصل ، القيم الأخلاقية ، والقدرة على التأثير الإيجابي في الطلاب",
"Trial and evaluation period":"فترة تجريبية وتقييم",
"The teacher is given a realistic trial period during which his performance in the classroom is evaluated by educational supervisors":"يُمنح المعلم فترة تجربة واقعية يتم فيها تقييم أدائه داخل الصف من قبل مشرفين تربويين",
"Continuous training and development":"التدريب والتطوير المستمر",
"Even after selection, teachers are required to attend regular training workshops and professional development programs":"حتى بعد الإختيار ، يُلزم المعلمون بحضور ورش تدريبية وبرامج تطوير مهني دوري",
"Alignment with the Academy's vision":"الإنسجام مع رؤية الأكاديمية",
"We ensure that the teacher is in line with the Academy's philosophy and educational mission in building an educated and leading generation":"نحرص على أن يتماشى المعلم مع فلسفة الأكاديمية ورسالتها التربوية في بناء جيل متعلم وقيادي",
"Student Name": "اسم الطالب",
  "Guardian Name": "اسم ولي الأمر",
  "Primary Phone Number": "رقم الهاتف الأساسي",
  "Secondary Phone Number": "رقم الهاتف الإحتياطي",
  "Country": "البلد",
  "Age": "العمر",
  "Grade": "الصف",
  "Email": "البريد الإلكتروني",
  "Register a new student": "تسجيل طالب جديد",
  "Submit": "إرسال",
  "Welcome to dashboard":"أهلاً بك في لوحة التحكم"



}